E-Lagori-Boards/D_TEJ_32/boards.txt

menu.clksrc=CPU Clock Frequency
menu.toolsloc=Tool Install Location

aries_devkit.name=ARIES DevKit

aries_devkit.menu.toolsloc.default=Default
aries_devkit.menu.toolsloc.manual=Manual
aries_devkit.menu.toolsloc.default.compiler.path={runtime.tools.riscv64-vega-elf-gcc.path}/bin/
aries_devkit.menu.toolsloc.manual.compiler.path=

#Point to the file for ./variants/<variant>/pins_arduino.h
aries_devkit.build.variant=standard

aries_devkit.menu.clksrc.aries100=100MHz FPGA Clock
aries_devkit.menu.clksrc.aries100.build.f_cpu=100000000L

aries_devkit.menu.clksrc.aries75=75MHz FPGA Clock
aries_devkit.menu.clksrc.aries75.build.f_cpu=75000000L

aries_devkit.build.mcu=rv32im

#"The 'core' file directory for this board, in ./cores
aries_devkit.build.core=arduino
# This sets a define for use in the compiled code.
aries_devkit.build.board=ARIES_DEVKIT
aries_devkit.build.boardenv=aries
aries_devkit.build.sdata.size=4096
#This selects the tool from "programmers.txt"
aries_devkit.program.tool=vegaxmodem
aries_devkit.upload.tool=vegaxmodem
# Limit is the 128MB Flash. Assume half is used for something else.
aries_devkit.upload.maximum_size=268435456
aries_devkit.build.ldscript={compiler.sdk.path}/link.lds

